Public Attributes | List of all members
API_ContourEdgeData Struct Reference
Element Manager API
Parameters of a shell contour edge. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_EdgeTrim  | edgeTrim
The edge trim data (see API_EdgeTrim).
API_OverriddenAttribute  | sideMaterial
Material override structure of the contour edge.
API_ShellBaseContourEdgeTypeID  | edgeType
Type of the contour edge (see API_ShellBaseContourEdgeTypeID).
Detailed Description
Parameters of a shell contour edge.
Member Data Documentation
◆ edgeTrim
 API_ContourEdgeData::edgeTrim
The edge trim data (see API_EdgeTrim).
◆ edgeType
 API_ContourEdgeData::edgeType
Type of the contour edge (see API_ShellBaseContourEdgeTypeID).
◆ sideMaterial
 API_ContourEdgeData::sideMaterial
Material override structure of the contour edge.